<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <?php 
  $title = "客户案例 -蓝码动力";
  $keywords = "图片管理,照片管理,解决方案,超级图库管理软件,SuperLib,网络版,蓝码动力";
  $description = "超级图库管理软件在电力企业、图书出版、学校、广告公司、建筑设计、机械设计及制造、装饰设计、摄影、机关单位等行业的应用解决方案。";
  include('meta.php'); ?>
</head>

<body>
  <?php include 'header.php'; ?>

  <div class="subbanner"><div class="banner_sol"></div></div>

  <div class="main">  
    <div class="content"> 
      <div class="here"><a href="index.php">首页</a> >> <a href="solutions.php">解决方案</a> >> 建筑装饰设计</div>   
      <div class="text2">
        <h2 align="center">SuperLib软件在装饰设计行业中的应用</h2>
        

     
  <div class="content">
    <h3>建筑装饰设计公司图库使用概况</h3>
    <p>建筑装潢设计公司主要以建筑室内装潢设计为主，公司有几万张图形/图像文件。公司的图库文件一般刻录在光盘中或分散在设计师的计算机中进行存储，当设计师需要一张图片素材时往往花很多时间在上千张的光盘中查找，对于图库资料的管理和存储以及设计师的应用公司耗费了大量的人力和财力而且管理和使用的效率很低。</p>
    <h3>建筑装潢设计公司图库管理软件需求</h3>
    <ul style="margin-right:20px;">
      <li>由于光盘损坏或流失容易造成图库资源丢失，所以对图库资源的存储最好能够存放在计算机中。</li>
      <li>图库资源能够同时提供给多个设计师使用，以提高图库资源的使用效率。</li>
      <li>由于图库资源中文件数目庞大、类别复杂，所以最好能够对图库中的文件进行详细的分类存储，而且对于一些多用途文件可以进行多重的分类。</li>
      <li>能够支持多种文件类型，能够对图库资源进行浏览对于常见文件能够生成缩略图预览。</li>
      <li>能对图库文件进行详细的说明，查看说明能够让设计师初步了解文件的内容。</li>
      <li>软件的搜索功能至关重要，使设计师能够在最短的时间内搜索到指定的文件。</li>
      <li>对其它图形/图像编辑软件有很好的支持，在查找到文件后能够打开或者预览文件。</li>
      <li>图库资源中存在重复文件使图库数据庞大，不利于管理，所以软件需要能够识别图库资源中的重复文件，使图库资源尽量精简。</li>
      <li>要防治图库资源人为流失或重要设计资料被窃取，需要有一定的安全机制来控制每个用户对图库的操作。</li>
    </ul>
    <h3>解决方案</h3>
    <p>基于以上需求，北京蓝码动力科技有限公司开发了SuperLib软件。SuperLib软件针对于设计师的工作需求具有非常丰富和实用的功能。如下是SuperLib软件对于建筑装潢设计公司需求的解决方案：</p>
    <div class="image"><img src="images/example1.jpg" alt=""></div>
    <ul style="margin-right:20px;">
      <li>SuperLib软件将图库资源存放在计算机中进行存储管理避免了使用光盘存储的一些弊端。</li>
      <li>SuperLib软件网络版使用 C/S 模式，在一台计算机中安装服务器端用来存储图库资源，其它计算机中安装客户端作为图库使用平台；这样使用网络将图库资源共享并同时提供给多个用户使用，有效提高图库资源的利用率。</li>
      <li>SuperLib软件理论上可以存储无限大的图库资源(只要单个文件容量不超过2G)。而且对于图库资源的分类 ，软件支持多重分类可以对一个文件根据其属性进行多重分类操作；软件有快速分类功能，能够使您对文件分类操作简单快速。</li>
      <li>SuperLib软件支持Windows下所有文件类型，并可以对常见的图形/图像文件进行浏览并生成缩略图进行预览。</li>
      <li>SuperLib软件能够对文件夹和文件添加说明信息：用户可以在说明信息中添加关键词对文件进行说明，例如：作者、内容、修改日期、风格等；在SuperLib软件中有管理关键词功能，用户输入预设定关键词就可以对图库文件批量的添加说明关键词，同样选择一个文件可以在说明视图中查看说明内容。SuperLib软件有强大的文件说明功能并为用户提供了方便快捷的操作。</li>
    </ul>
    <div class="image"><a href="images/example2_big.jpg" target="_blank"><img src="images/example2.jpg" alt="点击查看大图"></a></div>
    <ul style="margin-right:20px;">
      <li>SuperLib软件为用户提供了强大的搜索功能：用户不仅可以指定搜索范围和搜索文件类型，而且可以输入多个预设定关键词(文件说明信息)进行与、或搜索。搜索功能使您在庞大的图库资料中使用最短的时间搜索到指定文件，在搜索结果中您可以对文件进行编辑和预览。</li>
      <li>SuperLib软件对其它图形/图像编辑软件有很好的支持，您可以使用其它编辑软件在图库中打开文件进行编辑。对于dwg文件超级图库有更多的支持功能，可以对dwg文件进行插入、替换等操作，并可以对这些操作进行详细设置。</li>
      <li>SuperLib软件能够只能识别重复文件，软件将组成文件的每一个字节进行对比，如果每一个字节都相同那么这些文件被视为重复文件。在软件中有清除重复文件功能，用户可以方便的查找到图库中存在的重复文件进行清除。</li>
    </ul>
    <div class="image"><img src="images/example3.jpg" alt=""></div>
    <ul style="margin-right:20px;">
      <li>SuperLib软件网络版中分为客户端、服务器、控制台三个安装程序，图库管理者可以通过安装控制台来对每个用户添加用户名和密码，以及设置每个用户的操作权限。用户的操作权限包括了对文件的浏览、下载、写入 、拷贝、上传、灵活的应用软件的权限可以为图库提供很好的安全机制。在图库共享使用的情况下您不必担忧重要的文件泄漏或者流失。</li>
    </ul>
    <div class="image"><img src="images/example4.jpg" alt=""></div>
    <h3>实施效益</h3>
    <p>使用SuperLib软件存储管理图库资源能够最大限度的利用图库资源，同时使设计师的工作效率得到提高,为建筑装潢设计公司带来的好处是不可估量的。</p>
  </div>

        </div>
      </div>
    </div>
    <?php include 'footer.php'; ?>
  </body>
  </html>
