<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <?php 
  $title = "客户案例 -蓝码动力";
  $keywords = "图片管理,照片管理,解决方案,超级图库管理软件,SuperLib,网络版,蓝码动力";
  $description = "超级图库管理软件在电力企业、图书出版、学校、广告公司、建筑设计、机械设计及制造、装饰设计、摄影、机关单位等行业的应用解决方案。";
  include('meta.php'); ?>
</head>

<body>
  <?php include 'header.php'; ?>

  <div class="subbanner"><img src="images/banner_sol.png" width="1200" height="225" /></div>

  <div class="main">  
    <div class="content"> 
      <div class="here">首页 >> 解决方案 >>  各单位党委宣传部</div>   
      <div class="text2">
        <h2 align="center">SuperLib软件在各单位党委宣传部中的应用</h2>
        

     
<div class="content">
    <p>党委宣传部通常有大量照片需要管理。每次单位举办活动、召开会议、组织参观时，都会拍摄许多照片。时间长了，照片的数量就相当可观。这些照片都需要长时间保留，并可能随时需要调用。如果不及时对每次拍摄的照片进行整理、保存，在调用时就可能要花很多时间进行查找，有时甚至出现找不到的情况。而且整理照片的工作也是很繁琐的。</p>
    <p>SuperLib软件可全面彻底的解决以上问题。您可以将所有照片都存储在SuperLib软件中，利用软件强大的分类和搜索功能，大大提高工作效率。下面就让我们看看SuperLib软件的功能特点吧。</p>
    <p>首先，SuperLib软件具有多重分类的功能。所谓多重分类，是指照片可以按不同的分类标准，同时属于多个类别。例如，一张第二分公司的员工在打篮球的照片，可以按分支机构来分，属于“第二分公司”;也可按活动种类来分，放在“体育活动”的“篮球”子分类下。SuperLib软件是用虚拟文件夹的形式来表示分类的，一张照片属于多个分类，就是被放在多个虚拟文件夹中，它们只占用一个照片文件的存储空间，在数据库中记录其所属文件夹的信息，因此不论将照片放在多少个文件夹中，都不会增加磁盘空间占用量。</p>
    <p>其次，SuperLib软件提供快速分类功能，用户可用此功能对照片进行迅速的多重分类。在快速分类操作模式中，每个文件夹之前都有一个勾选框，用户只需选中要分类的照片，然后在相应的文件夹之前打勾，照片就被自动拷贝到这些文件夹中。由于拷贝过程并不拷贝真实磁盘文件，而只是在数据库中增加相关信息，因此拷贝速度很快。</p>
    <p>说明和关键词功能是SuperLib软件的另一大法宝。用户可以给文件夹和照片添加说明，这些说明可以是任意的文字，也可以是预定义的关键词。关键词是由用户预定义的，预定义完成后，用户只需勾选关键词即可。例如，可以将所有领导的名字做为预定义关键词，照片中出现了哪些领导，就将这些领导的字打勾。将来如果需要搜索某位领导的照片，就特别方便。</p>
    <p>SuperLib软件的搜索功能，可对照片的文件名、所在的文件夹名、文件或文件夹的说明等进行查找，帮助用户迅速找到所需照片。</p>
    <p>SuperLib软件有单机版和网络版，网络版适合多人分工协作。例如，某宣传部有两人负责摄影，两人负责文案，就可利用网络版进行协作，由摄影师上传各自所拍照片、分类、添加说明，文字编辑则查找所需照片并下载使用。</p>
    <p>SuperLib软件的存储能力很强，支持多存储区，可使用硬盘的多个分区、多个硬盘进行存储，存储容量几乎没有限制。</p>
    <p>为了向您更生动的介绍超级图库在各单位宣传部的应用情况，我们设计了一个情景对话，<a href="case_dwxcb_dialogue.php">点此处查看</a>。</p>
  </div>
        </div>
      </div>
    </div>
    <?php include 'footer.php'; ?>
  </body>
  </html>
