<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <?php 
  $title = "客户案例 -蓝码动力";
  $keywords = "图片管理,照片管理,解决方案,超级图库管理软件,SuperLib,网络版,蓝码动力";
  $description = "超级图库管理软件在电力企业、图书出版、学校、广告公司、建筑设计、机械设计及制造、装饰设计、摄影、机关单位等行业的应用解决方案。";
  include('meta.php'); ?>
</head>

<body>
  <?php include 'header.php'; ?>

  <div class="subbanner"><img src="images/banner_sol.png" width="1200" height="225" /></div>

  <div class="main">  
    <div class="content"> 
      <div class="here">首页 >> 解决方案 >>  各单位党委宣传部</div>   
      <div class="text2">
        <h2 align="center">SuperLib软件在各单位党委宣传部中的应用</h2>
        

     
<div class="content">
    <p>（小张给小王打电话）</p>
    <p>张：出差回来了？下班后我请吃饭。</p>
    <p>王：不行，我晚上要加班。这次出差去我们单位第二工程段，拍了很多照片回来，得马上整理，明天还要发宣传稿呢。</p>
    <p>张：怎么整理照片要花那么长时间啊？</p>
    <p>王：你不知道，我出去用数码相机拍，每次都拍几十、几百张回来;回来后存到电脑里，每张照片都要把照片内容、里面人物的人名做为照片的文件名。</p>
    <p>张：啊？那文件名岂不是很长？</p>
    <p>王：那没办法，以后我要搜索照片，只能靠文件名和文件夹名。</p>
    <p>张：这么做有隐患。文件夹和文件的名称都有长度限制，好像是100多个字符;全路径长度也有限制，好像是200多字符。</p>
    <p>王：啊？那怎么办？你是电脑专家，有没有好的解决办法？</p>
    <p>张：当然有了。用SuperLib软件就可以了。</p>
    <p>王：SuperLib软件？</p>
    <p>张：对！你把照片都存在这个图库软件里，在图库里同样可以建立文件夹，而且文件夹级数不受限制。</p>
    <p>王：那文件名长度和文件长度有限制吗？</p>
    <p>张：有限制，都是255个字符。其实根本不用起那么长的文件名，因为你可以给每张照片写说明，还可以给每个文件夹写说明，每个说明最多可以写65535个字符呢。</p>
    <p>王：那我可以把原来放在文件名里的东西放到文件说明里了？在搜索时可以查找说明的内容吧？</p>
    <p>张：那当然了。它还有多重分类功能。</p>
    <p>王：多重分类？</p>
    <p>张：对。就是一张照片可以按不同分类标准放在多个文件夹里，但只占一个照片文件的存储空间。</p>
    <p>王：真的？这个功能听起来挺新鲜。如果我有一张照片，里面有树，也有汽车，是不是可以同时放在“树木”和“汽车”文件夹里，但只占一个文件的磁盘空间？</p>
    <p>张：是的，就是这样。</p>
    <p>王：那太好了，以前我怕多占磁盘空间，就不敢按多种方法分类。这样以后我可以建立各种分类文件夹，分类的时候把照片拷贝到所有相应文件夹就行了。</p>
    <p>张：不用不用，拷贝多麻烦啊，用“快速分类”功能，打打勾就行了。</p>
    <p>王：快速分类？打勾？</p>
    <p>张：是啊，用快速分类功能，每个文件夹之前会出现一个勾选框，你先选中要分类的照片，然后看照片应该属于哪些文件夹，就在哪些文件夹之前打勾。</p>
    <p>王：这么方便？看来这个SuperLib软件还真不错。这软件还有什么功能？</p>
    <p>张：多了，你可能用得上它的关键词功能。</p>
    <p>王：关键词功能？</p>
    <p>张：嗯。你在给照片加说明的时候，要打字输入说明文字，照片多了也很麻烦。这时候你可以预定义很多关键词，然后只要根据照片内容在关键词前打勾，就完成了说明的录入。</p>
    <p>王：又是打勾？</p>
    <p>张：对。搜索的时候，也可以在要搜索的关键词前打勾。</p>
    <p>王：真方便。我用用这软件，试试看。</p>
    <p>张：SuperLib软件的官方网址是http://www.xcoolsoft.com。华军，天空等下载网站也有。</p>
    <p>王：我马上下载看看。…嗯，官网上有个下载中心。…咦，网络版和单机版，我下载哪个？</p>
    <p>张：如果只是你一个人用，就用单机版; 网络版可以共享图库，有权限管理，有访问记录，还可以支持多存储区。</p>
    <p>王：多存储区?</p>
    <p>张：是的。因为照片会越来越多，将来可能一个磁盘分区放不下，你可以把多个磁盘分区做为图库存储区。</p>
    <p>王：那所有分区都满了怎么办？</p>
    <p>张：简单，加硬盘，把新磁盘分区也加入作为图库存储区就行。</p>
    <p>王：这SuperLib软件也太强了！我们宣传部有好几个人呢，就直接下网络版来用就好了。对了，别的部门也经常来找我们要照片，是不是也可以给他们用，他们可以到我们的图库里找想要的照片？</p>
    <p>张：那当然。给他们浏览和下载权限，不要给写权限，免得误操作。</p>
    <p>王：嗯。你怎么对这软件这么熟悉，是不是用过啊？</p>
    <p>张：我们单位买了这个软件。</p>
    <p>王：原来如此。贵吗？</p>
    <p>张：不贵。他们按并发节点数销售。</p>
    <p>王：并发节点数？</p>
    <p>张：是的。就是同时在线人数。比如我们单位有100多台机器都装了，但只买了20个节点。</p>
    <p>王：哦。好，我先下载试用。有问题我还要请教呢。</p>
    <p>张：那你得请客才行！也可以问软件公司的技术支持。</p>
    <p>王：对啊！等忙完这段我请吃饭。</p>
    <p>张：好啊！你先忙吧！</p>
    <p>王：好，再见！</p>
  </div>
        </div>
      </div>
    </div>
    <?php include 'footer.php'; ?>
  </body>
  </html>
