<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <?php 
  $title = "客户案例 -蓝码动力";
  $keywords = "图片管理,照片管理,解决方案,超级图库管理软件,SuperLib,网络版,蓝码动力";
  $description = "超级图库管理软件在电力企业、图书出版、学校、广告公司、建筑设计、机械设计及制造、装饰设计、摄影、机关单位等行业的应用解决方案。";
  include('meta.php'); ?>
</head>

<body>
  <?php include 'header.php'; ?>

  <div class="subbanner"><img src="images/banner_sol.png" width="1200" height="225" /></div>

  <div class="main">  
    <div class="content"> 
      <div class="here"><a href="index.php">首页</a> >> <a href="solutions.php">解决方案</a> >>  图书出版</div>   
      <div class="text2">
        <h2 align="center">超级图库管理软件在图书出版行业的应用</h2>
        

     
<div class="content">
  <p class="title">
    超级图库管理软件在图书出版行业的应用
  </p>
  <p class="title_level_1">
    1 概述
  </p>
  <p>
    超级图库是一个图库管理软件，广泛应用于各行各业，包括装饰设计、出版社、编辑部、报社、设计院、摄影、政府部门、医院 、电子、网站建设、研究机构、各单位党委宣传部等。
  </p>
  <p>
    在图书出版行业中，超级图库管理软件已有多项成功的应用案例。本文北京博尔乐文化发展有限公司为例，介绍超级图库管理软件在图书出版行业中的应用情况。
  </p>
  <p class="title_level_1">
    2 需求情况
  </p>
  <p>
    北京博尔乐文化发展有限公司是一家中国业内知名的文化传播公司，运作销售的孕育图书占国内市场份额一半以上，通过人口出版社等出版。在百度图片中搜索"博尔乐文化发展"，得到的搜索结果如下图：
  </p>
  <center>
    <img src="images/solution_book_publish_1.jpg">
  </center>
  <p>
    博尔乐公司的图书，需要配大量的插图。除了少量插图是从外部购买之外，大部分是由公司内部自行拍摄。因此，所用的图片都是有版权的图片。现有图片两万余张，格式为jpg或tif。每张图片大小5M~50M左右。
  </p>
  <p>
    图书的作者在编写书籍时，需要选配插图。在没有软件辅助的情况下，工作量很大，而且容易出错。因为一本书可能有几十甚至上百张图片，而可能采用的图片就更多，每张图片的原图和小尺寸图及图片编号的对应关系必须手工维护，并且图片库中还不断地加入新的图片。
  </p>
  <p>
    为了简化工作流程，提高生产效率，博尔乐公司在找到超级图库管理软件后，特别对软件厂商（北京蓝码动力软件科技有限公司）提出是否能解决此流程的生产效率问题。为此，蓝码动力公司将原有的"借阅"功能进行了扩展，使之满足博尔乐公司的需要；并且免费为博尔乐公司加装了"蓝码设计图片管理系统"，进一步优化了工作流程。
  </p>
  <p class="title_level_1">
    3 超级图库管理软件的使用情况
  </p>
  <p class="title_level_2">
    3.1 总体流程
  </p>
  <p>
    使用超级图库管理软件后，由图片库负责人负责对图库内容的录入和整理，以及用户和权限的管理。
  </p>
  <p>
    图书作者可以在公司外部远程访问公司的图片服务器，进行插图图片的挑选，但只能看到图库负责人指定范围内的图片，并且无法下载原图。作者通过软件的"借阅"功能，填写借阅单，在每个借阅的图片后填写备注信息，说明此图是用于图书的什么章节、什么位置。全部挑选完毕后，提交借阅单。
  </p>
  <p>
    图片库负责人接收到借阅单后，如果没有疑问，可用软件生成一个压缩包，在包中有所有作者挑选好的插图的原图以及哪张图片用于哪个位置的一个汇总说明。将此压缩包发送给制作部门即可进行制作。
  </p>
  <p class="title_level_2">
    3.2 图库内容的录入和整理
  </p>
  <p>
    博尔乐公司原有两万多张图片，都存放在硬盘上。购买了超级图库管理软件后，将这些图片全部导入超级图库管理软件，并给这些图片设定关键词。例如，给一张图片设定关键词"插画 双色 妈妈 小孩 洗澡"，给另一张图片设定关键词"插画 双色 妈妈 换尿布"，等等。
  </p>
  <p class="title_level_2">
    3.3 用户和权限的管理
  </p>
  <p>
    图片库负责人具有管理员权限，她给相关同事每人都建立了一个用户名，设置了默认密码，每人自己修改密码。相关同事一般只有浏览和下载权限，不能修改和上传。如果有了新图片，由图片库负责人负责上传、分类、填写关键词等。
  </p>
  <p>
    图片库负责人还为公司外部的图书作者建立用户帐号，并给他们分配对一部分图库资源的浏览和水印下载权限。也就是说，外部图书作者只能看到一部分图库，并且不能下载原图，只能看到带水印的、尺寸较小（如800 x600）的图片。
  </p>
  <p class="title_level_2">
    3.4 图书作者挑选插图图片
  </p>
  <p>
    图书作者从图片库负责人处得到用户帐号后，可从公司外部直接访问图片库。在找到合适的插图后，将其加入借阅车，并填写备注，说明此图片是什么位置的插图。完成所有插图的挑选工作后，提交借阅单。
  </p>
  <p class="title_level_2">
    3.5 图片库负责人处理借阅单
  </p>
  <p>
    图片库负责人从超级图库控制台中可以看到目前有哪些未处理的借阅单。在查看借阅单后，如果没有问题，可根据借阅单用软件自动生成一个压缩包，压缩包中有所有图片的原图和使用位置说明。图片库负责人将此压缩包发送给制作部的同事进行制作。
  </p>
  <p class="title_level_2">
    3.6 小结
  </p>
  <p>
    通过以上流程，以往繁琐的手工操作大部分被软件的自动操作取代了，大大减轻了工作量，提高了生产效率。图片的管理也井井有条，图片资源不断丰富，为公司核心竞争力的形成贡献了力量。
  </p>
  <p class="title_level_1">
    4 更进一步 -- 蓝码设计图片管理系统的使用情况
  </p>
  <p>
    在使用了一段时间后，博尔乐公司反映外部图书作者不太适应使用超级图库客户端软件，主要是因为需要安装一下，而且客户端软件是面向所有行业的客户的，里面有许多功能用不到，所以觉得界面和操作都不够简洁。
  </p>
  <p>
    为了解决这个问题，软件厂商特地为博尔乐加装了蓝码设计图片管理系统。蓝码设计图片管理系统是在超级图库管理软件的基础上运行的，在加装之后，外部作者只要通过网页浏览器就可以访问博尔乐公司的图片库了，不需要安装任何软件，就跟平时上网一样。而且软件界面专门针对设计行业，界面美观、简洁，如下图所示。
  </p>
  <center>
    <img src="images/solution_book_publish_2.jpg">
  </center>
  <center>
    <img src="images/solution_book_publish_3.jpg">
  </center>
  <p class="title_level_1">
    5 总结
  </p>
  <p>
    在图书出版行业，超级图库管理软件已经成熟应用，并且软件厂商蓝码动力公司正在根据客户的需求，不断开发针对图书出版行业的增强功能，从而提高客户的生产效率和核心竞争力。详情请访问 <a href="http://www.xcoolsoft.com">http://www.xcoolsoft.com</a>
  </p>
</div>

        </div>
      </div>
    </div>
    <?php include 'footer.php'; ?>
  </body>
  </html>
