<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <?php 
  $title = "解决方案 -蓝码动力";
  $keywords = "图片管理,照片管理,解决方案,超级图库管理软件,SuperLib,网络版,蓝码动力";
  $description = "超级图库管理软件在电力企业、图书出版、学校、广告公司、建筑设计、机械设计及制造、装饰设计、摄影、机关单位等行业的应用解决方案。";
  include('meta.php'); ?>
</head>

<body>
  <?php include 'header.php'; ?>

  <div class="subbanner"><img src="images/banner_sol.png" width="1200" height="225" /></div>

  <div class="main">  
    <div class="content"> 
      <div class="here"><a href="index.php">首页</a> >> <a href="solutions.php">解决方案</a> >> 电力企业</div>   
      <div class="text2">
        <h2 align="center">超级图库管理软件在电力行业中的应用--某大型电力监理案例介绍</h2>
        

       <div class="content">
 
  <p class="title_level_1">
    1 概述
  </p>
  <p>
    超级图库是一个图库管理软件，广泛应用于各行各业，包括装饰设计、出版社、编辑部、报社、设计院、摄影、政府部门、医院 、电子、网站建设、研究机构、各单位党委宣传部等。
  </p>
  <p>
    在电力行业中，超级图库管理软件已有多项成功的应用案例。本文以某大型电力监理公司为例，介绍超级图库管理软件在电力行业中的应用情况。
  </p>
  <p class="title_level_1">
    2 业务需求
  </p>
  <p>
    某大型电力建设监理有限公司是由某省电力建设公司成建制转制而来，是国内电力系统最早成立之一、某省唯一的专业化综合性电力工程建设监理国有企业，是中国建设监理、中国电力建设监理协会成员单位，具有独立法人资格，上级主管单位为某省电力公司。主营电力工程建设监理、房屋建筑监理、电力设备监造、工程造价咨询与技术评估、招标代理和工程决算审查等服务业务。
  </p>
  <p>
    根据公司和上级主管部门的规定，工程监理必须按时报送工程项目的月报、简报、周报及工程图片等信息资料，并以此做为对相关责任人的考核指标。月报、简报、周报和工程照片等由相关责任人定时发送邮件给监查管理部信息员，再由信息员整理汇总后交领导审批、提出整改要求，通过后再编辑成册，抄送各相关部门。大致流程如下图所示。
  </p>
  <center><img src="images/solution_electric_power_1.gif"></center>
  <p>
    由于工程项目很多，监查管理部门的工作量很大，许多精力耗费在工程项目文件及照片的收发、存放、整理工作上，而且文件和照片越积越多，管理和搜索都很困难。因此公司需要一款文件及图片管理工具软件，能够将此月报、简报、周报、照片等资料的上报、查阅、管理等工作规范起来，形成一个高效、可靠的流程体系。
  </p>
  <p class="title_level_1">
    3 电力监理业务在线管理系统
  </p>
  <p class="title_level_2">
    3.1 系统架构
  </p>
  <p>
    超级图库管理软件经过简单的定制后，形成了《电力监理业务在线管理系统》软件。该软件由服务器、控制台、客户端三部分组成，如下图所示。
  </p>
  <center><img src="images/solution_electric_power_2.jpg"></center>
  <p>
    所有用户都可以通过公司内部局域网或互联网登录服务器，而在工作现场可以通过3G网络无线连接。
  </p>
  <p class="title_level_2">
    3.2  内容组织
  </p>
  <p>
    系统中的内容组织如下图所示。
  </p>
  <center><img src="images/solution_electric_power_3.png"></center>
  <p>
    系统管理员将内容分为电网监理、电源监理、设备监造、设计监理和系统指南与更新5部分，其中系统指南与更新中存放的是系统的使用说明和最新版本的客户端软件的安装程序，而其它4个部分都是监理工程的相关内容。以电网监理为例，在每个文件前面加上序号，这样便于排序，同时电话交流时比较方便，一报序号就知道是哪个文件夹了。
  </p>
  <p>
    00公司人力资源备援库中存放的是《公司人力资源备援库》和《公司各片区人员缺口与富裕统计表》的Exce表格文件，每月上传一次新版本。
  </p>
  <p>
    01电网部通报与纪要中存放的是部门通知、绩效考核通报、文件审核通报、会议纪要等，每月更新一次。
  </p>
  <p>
    02~09为各片区经理在线管理，每人一个文件夹，如下图所示。
  </p>
  <center><img src="images/solution_electric_power_4.png"></center>
  <p>
    每个片区经理的文件夹下有9项内容，如下图所示（因涉及客户机密，做了马赛克处理）。
  </p>
  <center><img src="images/solution_electric_power_5.png"></center>
  <p>
    片区经理必须按要求每天上传工作日记到01文件夹的相应月份的文件夹中，其它文件夹也要按照公司规定在每月或每周上传，而公司对该项目的考核意见也定期放在08文件夹。这样就避免了文件资料的收、发、整理操作，所有文件夹在项目开工前都已经由管理人员建立好，相关现场人员只要按要求上传文件资料，管理部门可以查看上传的资料并填写考核意见，公司信息、项目资料的收、发、管理统一在一个平台上，一步到位，极大减轻了信息管理的工作量。
  </p>
  <p class="title_level_2">
    3.3  权限管理
  </p>
  <p>
    权限管理是系统的一个非常重要的功能，每个人在系统中，根据其工作性质和职务级别，有不同的权限，能看到的信息、能做的操作各不相同。
  </p>
  <p class="title_level_3">
    3.3.1       用户
  </p>
  <p>
    管理员在系统中给每个人分配一个帐号，如下图所示。
  </p>
  <center><img src="images/solution_electric_power_6.png"></center>
  <p>
    系统中有很多用户，这里的截图只是一小部分。
  </p>
  <p class="title_level_3">
    3.3.2       用户组
  </p>
  <p>
    为了便于分配权限，需要将用户分为若干组，这样指定权限时将权限赋予用户组即可，如果发生人事变动，只要更改用户和用户组的隶属关系即可。本系统的用户组划分如下图所示。
  </p>
  <center><img src="images/solution_electric_power_7.png"></center>
  <p class="title_level_3">
    3.3.3       权限分配
  </p>
  <p>
    只有系统管理员拥有对根目录（全系统）的所有权限。
  </p>
  <p>
    “管理组-电网”对整个“电网监理”文件夹都有浏览、下载、写入、批量拷贝、上传的权限。而“公司领导组”没有写入的权限，只有浏览和下载的权限。这是因为公司领导只需要看到这些文件即可，不需要上传。
  </p>
  <center><img src="images/solution_electric_power_8.png"></center>
  <p>
    “电网片区经理组”和“电网总监组”都对00和01文件夹有浏览和下载的权限，即所有的电网片区经理和电网总监都可以查看公司人力资源备援库和电网部通报与纪要，如下图所示。
  </p>
  <center><img src="images/solution_electric_power_9.png"></center>
  <p>
    在02文件夹下，每个片区经理都有一个以自己名字命名的文件夹，该片区经理对此文件夹拥有所有权限，可浏览、下载，也可以写入，如下图所示。
  </p>
  <center><img src="images/solution_electric_power_10.png"></center>
  <p>
    对于其它文件夹，也都按照公司的业务规则，分配了权限，这里不再一一叙述。
  </p>
  <p class="title_level_2">
    3.4  日常工作流程
  </p>
  <p class="title_level_3">
    3.4.1       片区经理
  </p>
  <p>
    片区经理根据其权限，在登录后只能看到系统的一部分文件夹，如下图所示。
  </p>
  <center><img src="images/solution_electric_power_11.png"></center>
  <p>
    前面我们在系统的“内容组织”一节中已经介绍了系统有电网监理、电源监理、设备监造、设计监理4个业务板块，对于一个电网片区监理来说，他只能看到电网监理文件夹，看不到其它业务板块的文件夹。而且在“02片区经理在线管理”文件夹中只能看到自己的文件夹，看不到其他监理的文件夹。
  </p>
  <p>
    电网片区监理按照公司的规定，用Word、Excel等办公软件写好相应的报告文档，拍摄好工程照片，然后每日、每周、每月、每工程按时上传相关资料，并查看公司的考核意见。
  </p>
  <p class="title_level_3">
    3.4.2       管理员
  </p>
  <p>
    管理员可以用控制台软件随时查看在线用户情况，如下图所示。
  </p>
  <center><img src="images/solution_electric_power_12.png"></center>
  <p>
    还可查看所有的访问记录，如下图。
  </p>
  <center><img src="images/solution_electric_power_13.png"></center>
  <p class="title_level_3">
    3.4.3       其他用户
  </p>
  <p>
    还有其他十多组用户，职责各不相同，工作流程也不同，但在系统中操作的方式基本类似，这里不再赘述。
  </p>
  <p class="title_level_1">
    4         总结
  </p>
  <p>
    超级图库管理软件的功能强大，在特定行业中应用时，需要根据行业特点，设计应用方法。本案例中，已经完全突破了“图库管理”的范畴，利用软件的强大的权限管理能力，将各种文档都纳入系统的管理中，形成了全公司范围的一个监理业务工作平台，实际运用效果良好。
  </p>

</div>
        </div>
      </div>
    </div>
    <?php include 'footer.php'; ?>
  </body>
  </html>
