<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<?php
$title = "软件介绍 超级图库管理软件单机版 蓝码动力";
$keywords = "软件介绍,超级图库管理软件,SuperLib,单机版,蓝码动力";
$description = "超级图库管理软件单机版介绍：功能介绍,运行环境,演示录像,常见问题解答,成功案例,解决方案,软件下载,软件购买";
include ('meta.php');?>
</head>

<body>
<?php
  require ('header.php');
  ?>

<div class="subbanner"><div class="banner_pro"></div></div>

<div class="main">  
  <div class="content">    
    <div class="here"><a href="index.php">首页</a> >> <a href="products.php">产品</a>   >> <a href="superlib_personal.php">单机版</a> >> 常见问题解答</div>
    <div class="con_m"> 
      <?php $active="index"; include 'superlib_personal_left.php'; ?>
      <div class="con_r">
        <div class="text2" style="padding-top:0;padding-bottom:0;">
        <div class="content" style="width:890px;padding-top:0;padding-bottom:0;">
          <div>
  <ul class="personal_faq_ul">
    <li>注册、购买和升级
      <ul>
        <li><a href="#item1_1">未注册版在功能上有什么限制?</a></li>
        <li><a href="#item1_2">如何购买软件?</a></li>
        <li><a href="#item1_3">购买后，如何得到单机版的注册码?</a></li>
        <li><a href="#item1_4">我现在用的是单机版，将来要升级成网络版，数据能保留吗？</a></li>
        <li><a href="#item1_5">我将来要换个大些的硬盘，数据能倒到大硬盘上吗？</a></li>
      </ul>
    </li>
    <li>安装、设置和连接
      <ul>
        <li><a href="#item2_4">服务器端选access数据库，这时如果服务器上没有装office软件，这个图库可以用吗？</a></li>
        <li><a href="#item2_6">为了避免以后重装麻烦，我把它们都装到G盘中，这样是不是重装后就无需做任何改动，重装后，直接在G盘找到运行文件，超级图库还会正常运行？</a></li>
      </ul>
    </li>
    <li>超级图库管理软件的性能
      <ul>
        <li><a href="#item3_1">请问超级图库管理软件最大支持多大的容量，可以建立上百G的图片库嘛？</a></li>
        <li><a href="#item3_2">超级图库管理软件在对文件说明时字长有限制吗?</a></li>
        <li><a href="#item3_3">在超级图库管理软件中对文件夹的层级有没有限制呢?</a></li>
        <li><a href="#item3_4">超级图库管理软件支持那些文件类型?</a></li>
      </ul>
    </li>
    <li>图库备份和转移
      <ul>
        <li><a href="#item5_1">我想购买超级图库管理软件，但有个问题：我若每次重装系统又要重装超级图库，那我辛苦整理的岂不白费了，可以完整备份吗？</a></li>
        <li><a href="#item5_2">我把超级图库软件安装在C盘了，现在将把软件转移到D盘上，请问要怎么做？</a></li>
      </ul>
    </li>
    <li>DWG相关
      <ul>
        <li><a href="#item6_1">超级图库管理软件对dwg文件有那些支持？</a></li>
        <li><a href="#item6_2">我是一个新手我从网上下载的标准件是否也能应用到超级图库管理软件里？</a></li>
        <li><a href="#item6_3">为何超级图库管理软件中没有图块？</a></li>
      </ul>
    </li>
    <li>自定义属性
      <ul>
        <li><a href="#item8_1">公司里的图库中大多存放摄影图片，我需要把这些图片的作者、图片创建日期、图片拍摄地点等其它信息进行标注，方便我以后查看或查找，应该怎么做呢？</a></li>
      </ul>
    </li>
    <li>快速分类
      <ul>
        <li><a href="#item9_1">公司每天需要添加大量的图片、图形文件，在添加时需要对每个文件进行详细的分类。超级图库管理软件对图片的分类的操作方便吗？</a></li>
      </ul>
    </li>
    <li>搜索
      <ul>
        <li><a href="#item10_1">超级图库管理软件的搜索功能支持那些内容的搜索？支持模糊搜索吗？</a></li>
      </ul>
    </li>
    <li>客户端界面
      <ul>
        <li><a href="#item11_1">我的安装的超级图库客户端菜单栏不小心被我拖动，现在找不到了怎么办？</a></li>
      </ul>
    </li>
    <li>导入
      <ul>
        <li><a href="#item12_1">我想购买超级图库管理软件，但由于单位放假，我想在放假期间先在笔记本上安装超级图库，然后完成导图过程，等假期结束再从我的笔记本上导到单位服务器上可不可以？</a></li>
        <li><a href="#item12_2">为什么我将图库中导文件时，只能导入图片，而word这些文件却导不进去？</a></li>
        <li><a href="#item12_3">关于超级图库我有个问题不太明白，比如我上传一个图片时，如果图库里已有内容相同的一个图片，它是否会提示我？</a></li>
        <li><a href="#item12_4">CDR文件怎么上传不进去？是不是有什么设置?</a></li>
        <li><a href="#item12_5">正常的上传速度大约是多少？我传4G的文件夹用了很长时间.</a></li>
        <li><a href="#item12_6">为什么我导入avi文件没有产生缩略图？</a></li>
      </ul>
    </li>
    <li>真实文件说明
      <ul>
        <li><a href="#item13_1">请问超级图库中的说明与真实文件说明有什么区别？</a></li>
      </ul>
    </li>
    <li>重复文件
      <ul>
        <li><a href="#item14_1">如果两个图片内容相同，但文件类型不同，比如一个gif一个jpg，图库是否认为他们是重复文件？</a></li>
      </ul>
    </li>
    <li>智能压缩
      <ul>
        <li><a href="#item15_1">智能压缩是在哪一端完成的，速度如何？</a></li>
      </ul>
    </li>
    <li>删除
      <ul>
        <li><a href="#item16_1">我在客户端的显示界面上用右键功能删除文件，但是在后台的file夹里还存在，请问我如何把文件完全删除，使其不再占用硬盘空间呢？</a></li>
      </ul>
    </li>
  </ul>
</div>

<div class="faq_answer">
  <p style="font-size:18px;font-weight:bold;">答案</p>
  <p><a name="item1_1"></a>问: 未注册版在功能上有什么限制?</p>
  <blockquote>有以下限制：<br>
1. 做了一定次数的操作后，会有要求注册的对话框提示；<br>
2. 只能建立六个目录或子目录。<br></blockquote>
  <p><a name="item1_2"></a>问: 如何购买软件?</p>
  <blockquote>
    您可以直接与我们联系。
    Tel: <?php echo($company_tel3) ?> <?php echo($company_tel1) ?>
    E-mail:<a href="mailto:<?php echo($email) ?>"><?php echo($email) ?></a> 
    QQ:<a href="tencent://message/?Uin=<?php echo($qq) ?>"><?php echo($qq) ?></a></blockquote>
  <p><a name="item1_3"></a>问: 购买后，如何得到单机版的注册码?</p>
  <blockquote>首先安装好超级图库管理软件单机版，然后运行它，在服务器软件界面上按“注册”按钮，进入注册对话框。自己取一个用户名，将用户名和申请码发送给我们，我们会计算出注册码发送给您。您再将注册码、用户名准确填入注册对话框，按“注册”按钮即可注册成功。</blockquote>
  <p><a name="item1_4"></a>问: 我现在用的是单机版，将来要升级成网络版，数据能保留吗？</p>
  <blockquote>可以的。超级图库网络版和单机版的存储区结构和数据库的数据结构是相同的，因此在安装了网络版之后，用单机版的数据库和文件存储区覆盖网络版的数据库和文件存储区即可。购买网络版后，可联系我们进行在线协助。</blockquote>
  <p><a name="item1_5"></a>问: 我将来要换个大些的硬盘，数据能倒到大硬盘上吗？</p>
  <blockquote>可以的。</blockquote>
  <p><a name="item2_6"></a>问: 为了避免以后重装麻烦，我把它们都装到G盘中，这样是不是重装后就无需做任何改动，重装后，直接在G盘找到运行文件，超级图库还会正常运行？</p>
  <blockquote>是的，没错.</blockquote>
  <p><a name="item3_1"></a>问: 请问超级图库管理软件最大支持多大的容量，可以建立上百G的图片库嘛？</p>
  <blockquote>超级图库管理软件的容量限制：文件 &lt; 2G，即单个文件的大小不超过2G。目前我们的客户中，图库最大容量为9000G（9T）左右，使用没有问题。</blockquote>
  <p><a name="item3_2"></a>问: 超级图库管理软件在对文件说明时字长有限制吗?</p>
  <blockquote>超级图库管理软件对单个文件的说明,若输入汉字说明可以达到30000字左右,输入英文说明可以达到60000字左右.所以您在对文件进行说明是不必考虑文字过长的问题.</blockquote>
  <p><a name="item3_3"></a>问: 在超级图库管理软件中对文件夹的层级有没有限制呢?</p>
  <blockquote>超级图库管理软件中文件夹的层级没有任何限制,用户定义的文件夹层级几乎可以无限延伸.</blockquote>
  <p><a name="item3_4"></a>问: 超级图库管理软件支持那些文件类型?</p>
  <blockquote>超级图库管理软件支持WINDOW操作系统所有文件类型,并且可对常见的30种图形图象文件生成缩略图浏览.并且所有在Windows资源管理器中能显示缩略图的文件类型（包括avi, mov, max, ai, cdr等类型），都可以在超级图库中自动生成缩略图。</blockquote>
  <p><a name="item5_1"></a>问: 我想购买超级图库管理软件，但有个问题：我若每次重装系统又要重装超级图库，那我辛苦整理的岂不白费了，可以完整备份吗？</p>
  <blockquote>当然可以了。如果您使用的是超级图库管理软件单机版，只要备份整个超级图库安装目录就可以了。例如，超级图库安装在c:\program files\superlibClient目录下，您将c:\program files\superlibClient目录下的所有内容都备份起来就可以。重装系统后，将备份的内容拷贝到原来的目录下(一定要与重装前的路径完成相同)，这样就可以使用了。如果是网络版请您将服务器端的安装目录和所有存储区都备份，重装系统之后将备份的服务器端安装目录与所有存储区再复制粘贴到重装系统前的路径下。</blockquote>
  <p><a name="item5_2"></a>问: 我把超级图库软件安装在C盘了，现在将把软件转移到D盘上，请问要怎么做？</p>
  <blockquote>因为客户端、服务器端、控制台端的转移的情况都不一样，所以我们分情况进行了说明，<a href="move_d.php">请点击查看</a>。</blockquote>
  <p><a name="item6_1"></a>问: 超级图库管理软件对dwg文件有那些支持？</p>
  <blockquote>对于dwg文件超级图库管理软件中可以以缩样图的形式进行预览，并且直接双击使用AutoCAD打开。在使用Auto CAD 打开时，超级图库管理软件会自动检测本地安装的AutoCAD所有版本，用户可以对AutoCAD的版本进行选择。 超级图库管理软件可以讲dwg文件做插入和替换操作，并且对插入操作有详细的设置。您可以选择dwg文件在属性中对dwg文件的插入进行设置。</blockquote>
  <p><a name="item6_2"></a>问: 我是一个新手我从网上下载的标准件是否也能应用到超级图库管理软件里？</p>
  <blockquote>能。将标准件的dwg文件导入到超级图库管理软件中就可以了。</blockquote>
  <p><a name="item6_3"></a>问: 为何超级图库管理软件中没有图块？</p>
  <blockquote>超级图库是图库管理软件，本身是不带图块或图片资源的，需要使用者自己添加。另外，在我们的网站上收集了很多资源下载网站地址，<a href="photoresource.php">请点击此处查看</a>。</blockquote>
  <p><a name="item8_1"></a>问: 公司里的图库中大多存放摄影图片，我需要把这些图片的作者、图片创建日期、图片拍摄地点等其它信息进行标注，方便我以后查看或查找，应该怎么做呢？</p>
  <blockquote>您可以使用超级图库管理软件的自定义属性功能来对这些信息进行标注。首先进行属性定义，如<span class="main_h2">图片的作者、图片创建日期、图片拍摄</span>等，这样超级图库就知道每个文件都具备这些属性了。然后对每个文件输入具体的属性值，即每个文件的作者、日期、拍摄地点等。在您需要查找时您可以点击搜索，指定不同的属性输入作者、日期、地点、内容等进行搜索。</blockquote>
  <p><a name="item9_1"></a>问: 公司每天需要添加大量的图片、图形文件，在添加时需要对每个文件进行详细的分类。超级图库管理软件对图片的分类的操作方便吗？</p>
  <blockquote>首先超级图库管理软件支持文件的多重分类操作，也就是一个文件可以有多个文类。而且在超级图库管理软件中一个文件被进行多重的分类并不只是把文件进行复制而是在数据库中增加一条引言。这样不会增加重复文件的数量，大大节约了您的磁盘空间。其次，超级图库管理软件支持快速分类操作。以往当您要对大量的文件进行分类操作时可能需要对这些文件一个个进行复制粘贴操作，非常繁琐。而超级图库管理软件中您可以选择需要分类的一个文件，点击快速分类。在快速分类中您只需在文件夹前打勾就可以完成文件的分类。</blockquote>
  <p><a name="item10_1"></a>问: 超级图库管理软件的搜索功能支持那些内容的搜索？支持模糊搜索吗？</p>
  <blockquote>超级图库管理软件支持对文件说明内容、文件名、文件格式而且可以选择搜索的范围。超级图库管理软件支持模糊搜索。</blockquote>
  <p><a name="item11_1"></a>问: 我的安装的超级图库客户端菜单栏不小心被我拖动，现在找不到了怎么办？</p>
  <blockquote>超级图库从V3.2.12版开始增加了一个“恢复各视图原始位置”功能，可以在“菜单栏”的“查看”中找到“恢复各视图原始位置”，或使用快捷键 Ctrl+F5。</blockquote>
  <p><a name="item12_1"></a>问: 我想购买超级图库管理软件，但由于单位放假，我想在放假期间先在笔记本上安装超级图库，然后完成导图过程，等假期结束再从我的笔记本上导到单位服务器上可不可以？</p>
  <blockquote>是可以的，建议你在笔记本上安装时，不要修改存储区，这样图库存放在服务器端的安装目录下，等到您单位上班时，直接把整个服务器安装目录拷贝到单位服务器上就可以了，注意的是服务器端的粘贴路径应该与笔记本上的安装路径相同。</blockquote>
  <p><a name="item12_2"></a>问: 为什么我将图库中导文件时，只能导入图片，而word这些文件却导不进去？</p>
  <blockquote>请您点击“菜单栏”的“服务器”――“管理文件类型”，此处有三个选项，默认为第一项，你可以选择“接受所有类型的文件”，这样就能导入word文件了。</blockquote>
  <p><a name="item12_3"></a>问: 关于超级图库我有个问题不太明白，比如我上传一个图片时，如果图库里已有内容相同的一个图片，它是否会提示我？</p>
  <blockquote>不会提示，但当您上传一个文件时，软件会自动搜索图库中是否已经有内容完全相同的文件(即我们所说的重复文件)，如果没有，软件会将这个新加文件上传到图库中；如果图库中已有此文件的重复文件，就只增加一个目录索引，而不再将此文件上传。</blockquote>
  <p><a name="item12_4"></a>问: CDR文件怎么上传不进去？是不是有什么设置?</p>
  <blockquote>在客户端的“服务器”菜单里, 有“管理文件类型”. 选择“接受所有文件类型”，或者单独增加接受CDR文件类型都可以。</blockquote>
  <p><a name="item12_5"></a>问: 正常的上传速度大约是多少？我传4G的文件夹用了很长时间.</p>
  <blockquote>耗时是直接拷贝的2倍, 因为要检测重复文件，还要制作缩略图，以及智能压缩。</blockquote>
  <p><a name="item12_6"></a>问: 为什么我导入avi文件没有产生缩略图？</p>
  <blockquote>首先要看您的电脑的资源管理器中是否可以看到avi文件的缩略图。如果能看到，则应在此电脑上用超级图库客户端上传avi文件。</blockquote>
  <p><a name="item13_1"></a>问: 请问超级图库中的说明与真实文件说明有什么区别？</p>
  <blockquote>把一个文件进行多重分类之后，在某一分类目录下对此文件的说明添加新的注释，其它分类目录下，此文件的说明不变；而如果是在某一分类目录下对此文件的真实文件说明添加新的注释，其它分类目录下，此文件的真实文件说明也相应的改变。<a href="diff.php">请点击此处了解更详细的介绍</a>。</blockquote>
  <p><a name="item14_1"></a>问: 如果两个图片内容相同，但文件类型不同，比如一个gif一个jpg，图库是否认为他们是重复文件？</p>
  <blockquote>只有每个字节都一样的两个文件，才是重复文件。一个gif一个jpg，可能有很多字节不同，系统不认为它们是重复文件。</blockquote>
  <p><a name="item15_1"></a>问: 智能压缩是在哪一端完成的，速度如何？</p>
  <blockquote>智能压缩功能中，这个压缩过程是在客户端完成的，压缩后再上传给服务器，这样就减轻了服务器的负担，它的压缩速度跟windows中的winzip的压缩速度是一样的。</blockquote>
  <p><a name="item16_1"></a>问: 我在客户端的显示界面上用右键功能删除文件，但是在后台的file夹里还存在，请问我如何把文件完全删除，使其不再占用硬盘空间呢？</p>
  <blockquote>如果将所有文件都在客户端删除了，后台的file文件夹中的文件也会被全部删除的。如果只在客户端删除了一个或几个文件，就有不同的情况。如果是被删除的文件有与之相同的重复文件，则删除操作只删除数据库中的一条引用记录，真实的磁盘文件不会被删除；只有将所有的重复文件都删除之后，真实的磁盘文件才会被自动从files目录中删除。</blockquote>
</div>
        </div>
        </div>
      </div>
      <div class="clear"></div>
    </div>
  </div>
</div>
<?php include 'footer.php'; ?>
</body>
</html>